# CopingWarningMedium Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures..::..CopingWarningMedium Property
BuiltInFailures..::..ColumnInsideWallFailures Class See Also
---
Coping applied, but only in Medium Detail Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopingWarningMedium { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopingWarningMedium As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopingWarningMedium {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace